#include <iostream>
using namespace std;


#if 0
int main()
{
    int a = 10;

    /*引用格式*/
    int &b = a;
    cout << "a = " << a << endl;
    cout << "b = " << b << endl;

    /*引用后，相当于给a起了别名，可以通过这个别名更改a的值*/
    b = 100;
    cout << "a = " << a << endl;
    cout << "b = " << b << endl;

    /*引用必须初始化*/
    //int &d;/*错误*/

    /*引用不可改变指向*/
    int c = 50;
    b = c;/*这是赋值操作，不是改变引用的指向*/
    //int &b = c;/*这里将引用b从a改变为c，不允许*/
    system("pause");
    return 0;
}
#endif


#if 0
/*===============================================================================================*/
/*=========                            引用作为函数形参                                   ==========*/
/*===============================================================================================*/

/*交换值-指针*/
void swap1(int*a,int*b)
{
    int temp = *a;
    *a = *b;
    *b = temp;
}
/*交换值-引用*/
void swap2(int& a,int& b)
{
    int temp = a;
    a = b;
    b = temp;
}
int main()
{
    int a = 10;
    int b = 20;
    swap1(&a, &b);
    cout << "a = " << a <<", b = " << b << endl;
    swap2(a, b);
    cout << "a = " << a <<", b = " << b << endl;
    system("pause");
    return 0;
}
#endif

#if 0
/*===============================================================================================*/
/*=========                                 引用作为函数返回值                            ==========*/
/*===============================================================================================*/

/*不能返回局部变量的引用，同指针一样，引用就相当于一个指针常量*/
// int& fun1()
// {
//     int a = 1;
//     return a;
// }

/*将引用作为函数返回值时，函数可以作为左值*/

// int b = 1;
int& fun2()
{
    static int b = 1;
    // cout << "b = " << b << endl;
    return b;
}
int main()
{
    // int &temp1 = fun1();/*这里会报出段错误*/
    // cout << "temp1 = " << temp1 << endl;
    int &temp2 = fun2();
    cout << "temp2 = " << temp2 << endl;

    /*返回值为引用的函数可以为左值*/
    fun2() = 100;
    cout << "temp2 = " << temp2 << endl;
    system("pause");
    return 0;
}

#endif

#if 0
/*===============================================================================================*/
/*=========                             引用本质-指针常量                                 ==========*/
/*===============================================================================================*/

int main()
{
    int a = 10;
    int &b = a;/*相当于int* const b = &a，指针常量不能更改指针指向，引用也就不能更改引用对象*/
    b = 10;/*编译器会将其转化为*b = 10*/
    system("pause");
    return 0;
}
#endif


#if 1
/*===============================================================================================*/
/*=========                                  常量引用                                   ==========*/
/*===============================================================================================*/

/*常量引用常用于修饰形参，防止误操作改变实参*/
void show_value(const int& a)
{
    cout << a << endl;
}

int main()
{
    //int &a = 10;/*这会报错，可使用常量引用*/
    const int &b = 10;
    cout << "b = " << b << endl;

    /*常量引用做形参*/
    int c = 50;
    show_value(c);
    system("pause");
    return 0;
}
#endif