#include <iostream>
using namespace std;

#if 0

/*===============================================================================================*/
/*=========                            函数默认参数                                      ==========*/
/*===============================================================================================*/

/*c++中，函数是可以有默认参数的*/
/*函数一个形参有默认参数，这之后的形参都需要有默认参数*/
/*如下面的fun1中，形参int b有默认参数，则int c也需要有默认参数*/
void fun1(int a, int b = 10, int c = 50)
{
    cout << "a = " << a << ", b = " << b << ", c = " << c << endl;
}

/*函数声明有默认参数时，函数定义就不能有默认参数*/
/*声明*/
void fun2(int a, int b = 10, int c = 50);

void fun2(int a, int b, int c)
{
    cout << "a = " << a << ", b = " << b << ", c = " << c << endl;
}

int main()
{
    int a = 1;
    int b = 3;
    int c = 2;
    fun1(a);/*有默认参数的函数可以不传入默认形参*/
    fun1(a, b);/*默认形参有实参传入时，不再使用默认值*/

    fun2(a, b);/*函数声明有默认参数时，函数定义就不能有默认参数*/
    system("pause");
    return 0;
}

#endif


#if 0

/*===============================================================================================*/
/*=========                            函数占用参数                                      ==========*/
/*===============================================================================================*/

/*c++函数可以有占位参数，语法为:*/
/*  返回值 函数名(数据类型)    */
/*函数占位参数必须传入实参*/
void fun1(int a,int)
{
    cout << "hello world" << endl;
}

/*占位参数也可以有默认参数*/
void fun2(int a,int =20)
{
    cout << "hello world" << endl;
}

int main()
{
    int a = 1;
    int b = 2;
    // fun1(a);/*错误*/
    fun1(a, b);
    fun2(a);/*有默认参数的占位参数可以不传入实参*/
    system("pause");
    return 0;
}

#endif

#if 0

/*===============================================================================================*/
/*=========                             函数重载                                        ==========*/
/*===============================================================================================*/

/*c++中，允许多个函数名字相同，但需要满足以下条件:*/
/*1. 函数名相同*/
/*2. 同名函数处于同一作用域*/
/*3. 同名函数需要满足以下任一条件：形参类型不同 或 形参数量不同 或 形参顺序不同*/
/*返回值类型不同不能作为函数重载条件*/

void fun(int a)
{
    cout << "调用fun1 " << endl;
}

/*形参类型不同*/
void fun(double a)
{
    cout << "调用fun2 " << endl;
}

/*形参数量不同*/
void fun(int a, double b)
{
    cout << "调用fun3 " << endl;
}

/*形参顺序不同，注意是从形参类型区别顺序的，而不是形参名*/
/*如void fun(int a, int b)与void fun(int b, int a)不能重载*/
void fun(double a, int b)
{
    cout << "调用fun4 " << endl;
}

int main()
{
    int a = 10;
    fun(a);/*调用第一个*/
    fun((double)a);/*调用第二个*/
    fun(a, (double)a);/*调用第三个*/
    fun((double)a, a);/*调用第四个*/
    system("pause");
    return 0;
}

#endif

#if 1

/*===============================================================================================*/
/*=========                        函数重载注意事项                                     ==========*/
/*===============================================================================================*/

/*有两种函数重载需要注意，一是引用和常量引用作为重载条件；二是默认参数形参无法作为函数重载条件*/

/* const int& 与 int& 也可作为函数重载条件，但调用时需注意*/

void fun(int& a)
{
    cout << "运行fun1" << endl;
}

void fun(const int& a)
{
    cout << "运行fun2" << endl;
}

/*默认参数无法作为函数重载的条件，如下会报错*/
// void fun(int& a,int b=10)
// {
//     cout << "运行fun3" << endl;
// }


int main()
{
    int a = 10;
    /*引用与常量引用作为重载调节时，调用函数时需要区分*/
    fun(a);/*调用fun1*/
    fun(100);/*调用fun2*/
    system("pause");
    return 0;
}

#endif